Repository: IlhamSetiawan/tuxclocker
Catalog: po/*.po
Languages: fi

source: Automatic
fi: Automaattinen

source: Lowest
fi: Alhaisin

source: Highest
fi: Korkein

source: Manual
fi: Manuaalinen

source: Base Levels
fi: Perustasot

source: Lowest Core Clock
fi: Alhaisin ytimen kellotaajuus

source: Lowest Memory Clock
fi: Alhaisin muistin kellotaajuus

source: Highest Clocks
fi: Korkeimmat kellotaajuudet

source: Temperature
fi: Lämpötila

source: Fan Mode
fi: Tuulettimen hallintatapa

source: Fan Speed
fi: Tuulettimen nopeus

source: Power Limit
fi: Tehorajoitus

source: Power Usage
fi: Toimintateho

source: Core Clock
fi: Ytimen kellotaajuus

source: Memory Clock
fi: Muistin kellotaajuus

source: Core Clock Offset
fi: Ytimen kellotaajuuspoikkeama

source: Core Voltage
fi: Ytimen jännite

source: Core Voltage Offset
fi: Ytimen jännitepoikkeama

source: Memory Voltage
fi: Muistin jännite

source: Point
fi: Piste

source: State
fi: Tila

source: Performance Parameter Control
fi: Suorituskykyparametrien hallinta

source: Core Utilization
fi: Ytimen käyttöaste

source: Memory Utilization
fi: Muistin käyttöaste

source: Maximum Memory Clock
fi: Muistin enimmäiskellotaajuus

source: Minimum Memory Clock
fi: Muistin vähimmäiskellotaajuus

source: Maximum Core Clock
fi: Ytimen enimmäiskellotaajuus

source: Minimum Core Clock
fi: Ytimen vähimmäiskellotaajuus

source: Slowdown Temperature
fi: Hidastumislämpötila

source: Shutdown Temperature
fi: Sammumislämpötila

source: MB
fi: Mt

source: Used Memory
fi: Käytetty muisti

source: Video Memory
fi: Videomuisti

source: Temperatures
fi: Lämpötilat

source: Voltage-Frequency Curve
fi: Jännite-taajuuskäyrä

source: Clocks
fi: Kellotaajuudet

source: Performance
fi: Suorituskyky

source: Fans
fi: Tuulettimet

source: Power
fi: Teho

source: Core Performance States
fi: Ytimen suorituskykytilat

source: Memory Performance States
fi: Muistin suorituskykytilat

source: Utilizations
fi: Käyttöasteet

source: Core
fi: Ydin

source: Overall Temperature
fi: Kokonaislämpötila

source: Memory Power Usage
fi: Muistin toimintateho

source: Core Power Usage
fi: Ytimen toimintateho

source: Power Saving
fi: Virransäästö

source: Scheduler Controlled
fi: Vuorottimen hallitsema

source: Balanced Performance
fi: Tasapainoinen suorituskyky

source: Default
fi: Oletusarvo

source: Balanced Power Saving
fi: Tasapainoinen virransäästö

source: Voltages
fi: Jännitteet

source: Power Usage Mode
fi: Virrankulutustila

source: Maximum Frequencies
fi: Enimmäistaajuudet

source: Minimum Frequencies
fi: Vähimmäistaajuudet

source: Governor
fi: Säädin

source: Power Saving Tendencies
fi: Virransäästöherkkyydet

source: Frequencies
fi: Taajuudet

source: Memory Clock Offset
fi: Muistin kellotaajuuspoikkeama

source: Total Memory
fi: Kokonaismuisti

source: Reserved Memory
fi: Varattu muisti

source: PCIe Bandwidth Utilization
fi: PCIe -väylän käyttöaste

source: Fan
fi: Tuuletin

source: (Parametrized)
fi: (Parametrisoitu)

source: No value set
fi: Ei asetettua arvoa

source: Parametrize...
fi: Parametrisoi...

source: Reset to default
fi: Nollaa oletusarvoon

source: Remove settings from profile
fi: Poista asetukset profiilista

source: Showing:
fi: Näytetään:

source: Apply changes
fi: Toteuta muutokset

source: Assignables
fi: Säädettävät solmut

source: Dynamic Values
fi: Dynaamiset arvot

source: Static Values
fi: Staattiset arvot

source: Connecting %1 with:
fi: Yhdistetään %1 solmuun:

source: A node to connect with needs to be selected
fi: On valittava yhdistettävä solmu

source: At least two points need to be placed
fi: On sijoitettava ainakin kaksi pistettä

source: Settings
fi: Asetukset

source: Apply profile settings automatically
fi: Toteuta profiilin asetukset automaattisesti

source: Use profile
fi: Käytä profiilia

source: Add profile
fi: Lisää profiili

source: Remove selected
fi: Poista valittu

source: Unnamed
fi: Nimetön

source: Use tray icon
fi: Käytä ikonia tehtäväpalkissa

source: Enabling this hides TuxClocker into the tray instead of exiting when closing the window.
fi: Tämän ottaminen käyttöön piilottaa TuxClockerin tehtäväpalkkiin sulkemisen sijaan ikkunan suljettaessa.

source: Cancel
fi: Peru

source: Save
fi: Tallenna

source: Couldn't connect to TuxClocker daemon: %1
fi: TuxClockerin taustaprosessiin yhdistäminen epäonnistui: %1

source: &Maximize TuxClocker
fi: &Maksimoi TuxClocker

source: &Quit
fi: &Lopeta
